<template>
	<view class="container">
		<view class="top">
			<view class="p">尊敬的客户，在您使用六谷大药房小程序使用我们的服务前，请
				仔细阅读本用户协议。</view>
			<view class="p">用户协议</view>
			<view class="p">本协议是您与湖南六谷大药房连锁有限公司签署的《用户协议》。您在六谷大药房成
                                                                功注册后，即被视为已阅读、理解、接受本协议条款。本协议可由我们
				不时作出修订，且构成您与我们之间达成的有关六谷大药房使用、具有约束力的协议。
				您在修订发布后继续使用六谷大药房，即视为您已接受了相关修订．如果您不同意本
				协议或相关修订．则应立即退出并取消关注六谷大药房小程序。</view>
			<view class="p tip">您使用这个小程序视为您同意授权将您的用户信息交付湖南六谷大药房连锁有限公
                                                                司，如果您不同意请选择退出并取消关注六谷大药房小程序。</view>
				<view class="p">如果您不满十八（18）周岁，您应确保与您的父母或监护人共同阅读本协
				议，以便您及您的父母或监护人理解并同意本协议的内容。</view>
			<view class="p">1．用户许可</view>
			<view class="p">1.1我们允许您在本协议范围内享有个人的、非排他性的、不可转让的使用本
				 六谷大药房的权利。但是您不得有以下行为：</view>
			<view class="p">1.1.1以任何方式出售、转让、分发、修改或传播六谷大药房或与六谷大药房有关的文
				字、图片、音乐、条形码、视频、数据、超链接、展示及其他内容（“内容”);</view>
			<view class="p">1.1.2储存或发送淫秽、诽谤、暴力或者其他非法资料；</view>
			<view class="p">1.1.3储存或发送包含软件病寿或其他有害的计算机的程序资料；</view>
			<view class="p">1.1.4利用服务或六谷大药房程序进行违法犯罪活动；</view>
			<view class="p">1.1.5利用服务或六谷大药房程序侵犯他人合法权益；</view>
			<view class="p">1.1.6利用服务或六谷大药房程序影响网络的正常运行；</view>
			<view class="p">1.1.7损害六谷大药房程序数据的完整性或性能。</view>
			<view class="p">本用户许可同样适用于本六谷大药房的任何更新、补充或替代产品，但相关更新、补
				充或替代产品中有相反规定的除外．</view>
			<view class="p">1.2如果我们认为您存在任何违反本协议的行为或存在其他损害六谷大药房的行为，</view>
			我们保留在不另行通知的情况下随时禁止您继续使用 六谷大药房和相关服务的权利。
			<view class="p">2．注册帐号、密码及安全性</view>
			<view class="p">2.1注册资格您承诺：您具有完全民事权利能力和行为能力或虽不具有完全民
			事权利能力和行为能力但经您的法定代理人同意并由其代理注册 六谷大药房服务。</view>
			<view class="p">2.2注册流程；您同意根据 六谷大药房注册页面的要求提供手机号码并通过认证程
				序注册账号，或者通过微信授权快速注册账号。您将对账户安全负全部责任。
				另外．每个用户都要对以其用户名进行的所有活动和事件负全责。</view>
			<view class="p">2.3您成功注册后，您同意接收我们发送的与六谷大药房管理、运营相关的微信订
				阅号和／或客户端消息和／或电子邮件和／或短消息。</view>
			<view class="p">2.4注册成功后，您有权根据 六谷大药房相关页面公示的服务规则获取六谷大药房
				的相关信息、发送订单、授权我们通过您指定的账户划扣服务费用并享受其他相
				关服务。</view>
			<view class="p">2.5您若发现任何非法使用用户帐号或存在安全漏洞的情况，请立即反馈给我
				们。</view>
			<view class="p">3．用户信息保护</view>
			<view class="p">3.1您同意向六谷大药房提供某些信息包括但不限于身份识别信息、平台操作信息、
				位置信息、支付信息、个人信用信息以及其他根据我们的产品和需要而收集的您
				的个人信息(“用户信息”）。</view>
			<view class="p">3.2您同意向我们传输用户信息，并授权我们在六谷大药房功能所需的范围内以本
				协议所述的目的记录、处理及存储上述用户信息。</view>
			<view class="p">3.3我们通过以下方式收集、分享、使用您的用户信息：</view>
			<view class="p">3.3.1为了向您提供更加便捷、人性化的服务，我们可能需要您提供一些个
				人信息。包括：姓名／企业名称、地址、电话号码等个人资料。
				为了保证您能够享受更好的服务，您需要及时更新上述注册资料，否则我们可能
				因为您资料不准确而无法提供服务．</view>
			<view class="p">3.3.2如果您将 六谷大药房与您在第三方支付平台的账户关联，您需要授权我们
				通过您指定的账户划扣服务费。</view>
			<view class="p">3.3.3为了向您提供更便捷的售前服务（如查询附近门店）以及售后服务等，
				 六谷大药房将会使用、保存您的位置信息、交易信息、操作信息答。</view>
			<view class="p">3.3.4为了改进服务质量．我们会向您征集反馈意见，包括您参与的问卷调
				杳、在线意见反馈、客服投诉答。</view>
			<view class="p">3.3.5以其他必要方式收集用户信息。</view>
			<view class="p">3.4除手机号码外，您的头像、姓名、性别、生日、邮箱等信息均为选填信息，
				您可以选择是否填写。如您填写上述信息，我们也仅会从为您提供更好服务的角
				度使用上述信息。</view>
			<view class="p">3.5．我们将采取技术措施和其他必要措施．确保用户信息安全．防止在本服
				务中收集的用户信息泄露。在发生前述情形或我们发现存在发生前述情形的可能
				时将及时采取措施补救。</view>
			<view class="p">3.6我们承诺未经过您的同意不将您的个人信息任意披露。但在以下情形下，
				我们将无法作出前述保证并披露您的相关信息。这些情形包括但不限于：</view>
			<view class="p">3.6.1为了您的服务、交易顺利完成，我们不得不把您的某些用户信息，如
				您的姓名、电话、配送地址等提供给相关服务方，以便于他们及时与您取得联系，
				提供服务；</view>
			<view class="p">3.6.2当您在六谷大药房的行为违反服务条款，或可能损害他人权益或导致他人
				遭受损害，只要我们相信披露您的用户信息是为了辨识、联络或采取法律行动所
				必要的行动时；</view>
			<view class="p">3.6.3根据法律法规规定必须披露或公开的用户信息；</view>
			<view class="p">3.6.4有权机关依法执行公务．要求提供特定用户信息；</view>
			<view class="p">3.6.5您与我们及合作单位之间就用户信息的使用公开达成约定，我们因此
				向合作单位公开用户信息；</view>
			<view class="p">3.6,6任何由于黑客攻击电脑病毒侵入或其他不可抗力事件导致用户信息的
				泄露，</view>
			<view class="p">3.7您同意我们在以下事项中使用用户信息：</view>
			<view class="p">3.7.1向您及时发送重要的通知，如软件更新、本协议条款的变更：</view>
			<view class="p">3.7.2进行审计数据分析和研究等，以改进产品服务及与用户之间的沟通：</view>
			<view class="p">3.7.3依照本协议约定，我们管理、审查用户信息及采取处理的措施：</view>
			<view class="p">3.7.4适用法律法规规定的其他事项。
				除上述事项外，未取得您事先同意，我们不会将用户信息用于其他任何用途。</view>
			<view class="p">4．责任</view>
			<view class="p">4.1我们向您提供的预订信息仅供您参考，并不构成保证。我们将在合理的范
				围内尽力保证该等信息准确，但无法保证其中没有任何错误。
				由于六谷大药房的功能受到客观技术条件的影响，您理解并同意， 六谷大药房在其使用过程
				中发生暂时中断是正常的现象。
				我们不能保证 六谷大药房的功能不会发生中断或不出现差错，也不能保证提供六谷大药房的
				网站或服务器不存在病毒或其他有害成分。</view>
			<view class="p">4.2您通过 六谷大药房请求的产品和服务质量由六谷负责控制和监督；</view>
			<view class="p">4.3我们将不承担任何基于不可杭力等非人为因素给您造成的损失。不可抗力
				包括但不限于：</view>
			<view class="p">4.3.1大雾、雷雨、沙尘、道路积雪、结冰、低能见度等危及行车安全的恶
				劣气象条件；</view>
			<view class="p">4.3.2洪涝、台风、冰雹、暴雪、地震、山体崩塌、滑坡、泥石流、海啸等
				自然灾害；</view>
			<view class="p">4.3.3公安机关交通管理部门在集会游行、大型运动会、道路桥梁建设、救
				灾抢险等情形下实施的交通管制等措施；</view>
			<view class="p">4.3.4黑客攻击、电信部门技术调整导致之重大影响、因政府管制而造成
				之暂时关闭、病毒侵袭等事件。</view>
			<view class="p">4.4我们对于您的以下行为引起的直接、间接、偶然及继起的损害不负责任：</view>
			<view class="p">4.4.1不正当使用服务；</view>
			<view class="p">4.4.2故意隐瞒重要信息;</view>
			<view class="p">4.4.3传送的信息不符合规定等。</view>
			<view class="p">4.5在适用法律允许的最大范围内．在任何情况下，(A）我们均不就 六谷大药房
				的使用对用户承担责任；
				且（B）不就任何间接的、特殊的、偶然的、附随的或惩罚性的损害对您承担
				责任，
				包括但不限于商誉损失、利润损失、用户信息丢失、失窃或受损、无法使用 六谷大药房、
				或者设备故障或失灵所导致的损害。您享有的唯一救济即停止使用 六谷大药房。</view>
			<view class="p">5．知识产权</view>
			<view class="p">六谷标识以及与 六谷大药房相关的其他六谷商标、服务标志、图像和标识均为尚
				划算的商标或注册商标（统称“六谷标志”）。与 六谷大药房相关的其他商标、服
				务标志、图像和标识为其各自所有人的商标（统称“第三方标志”）。未经尚划
				算或相关商标持有人的事先书面许可，用户不得全部或部分地复制、模仿或使用
				六谷标志或第三方标志。 六谷大药房和内容受到与著作权、商标、专利、商业秘密
				及其他专有权利相关的国际条约、法律、法规、行政规章等规定的保护，您可在
				六谷或内容所有人授权的情况下使用包含保护数字信息的安全组件。</view>
			<view class="p">6．合约期限及变更、终止</view>
			<view class="p">6.1我们和您订立的这份协议是无固定期限协议。</view>
			<view class="p">6.2您有权在结清全部应付费用后，随时通过永久性删除移动设备上安装的
				 六谷大药房程序来终止协议。</view>
			<view class="p">6.3我们保留随时修改或替换本协议，或者更改、暂停服务及六谷大药房程序（包括
				但不限于任何功能、数据库或内容）的权利。</view>
			<view class="p">
				<view class="p">7.其他</view>
				<view class="p">7.1本用户协议部分条款或附件无效或终止的，我们有权根据具体情况选择是
					否维续履行具他条款。</view>
				<view class="p">7.2本协议适用中国法律。本协议履行中发生的任何争议，由湖南六谷大药房
                                                               连锁有限公司所在地人民法院管辖</view>
				<view class="p foot">湖南六谷大药房连锁有限公司</view>
			</view>
		</view>
	</view>
</template>

<script>
	export default {
		data() {
			return {}
		},
		onLoad(option) {},
		methods: {}
	}
</script>

<style lang='scss'>
	page {
		background: #fff;
	}

	.container {
		position: relative;
		width: 100vw;
		height: 100vh;
		padding: 0 50rpx;
	}

	.top {
		margin-top: 50rpx;
	}

	.p {
		font-size: 28rpx;
		line-height: 48rpx;
		word-break: break-all;
	}
	.tip{
		text-decoration:underline;
		font-weight: bold;
	}

	.foot {
		text-align: right;
		margin-bottom: 20rpx;
	}
</style>
